GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7d2: file p1original.c, line 22.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:22
22  {
(gdb) n
24    x=input_num();
(gdb) n
Enter the number: 5
25    y=input_num();
(gdb) n
Enter the number: 6
26    find_sum(&x,&y,&sum);
(gdb) s
find_sum (a=0x7ffc935ecbec, b=0x7ffc935ecbf0, c=0x7ffc935ecbf4)
    at p1original.c:13
13    *c=*a+*b;
(gdb) n
14  }
(gdb) n
main () at p1original.c:27
27    output(x,y,sum);
(gdb) s
output (a=5, b=6, c=11) at p1original.c:18
18    printf("The sum of %d and %d is %d",a,b,c);
(gdb) n
19  }
(gdb) n
main () at p1original.c:28
28    return 0;
(gdb) c
Continuing.
The sum of 5 and 6 is 11[Inferior 1 (process 1034) exited normally]
(gdb) 